Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Untersetzungsgetriebe für Landfahrzeuge
en: Reduction gears for land vehicles

source: Vorratsbehälter als Teile von Landfahrzeugkupplungen
en: Reservoirs being parts of land vehicle clutches

source: Einklappbare Abdeckungen für Lastkraftwagen
en: Retractable covers for goods carrying vehicles

source: Fahrzeugsicherheitsgurte für Kinderwagenkörbe
en: Vehicle safety harnesses for pram bodies

source: Blattfedern [Teile von Fahrzeugaufhängungen]
en: Leaf springs [land vehicle suspension parts]

source: Bremsschuhe [Fahrradteile]
en: Brake shoes [bicycle parts]

source: Schutzabdeckungen [angepasst] für Fahrzeuge
en: Protecting covers [shaped] for vehicles

source: Schutzbezüge für Fahrzeugsitze [angepasst]
en: Protective covers for vehicle seats [fitted]

source: Hitzeschutzschilde für Fahrzeuge
en: Protective heat shields for vehicles

source: Nicht motorisierte zusammenklappbare Gepäckkarren
en: Non-motorized, collapsible luggage carts

source: Satteltaschen für Motorräder
en: Panniers for motorcycles

source: Karosserien für Autos
en: Coachwork for motor vehicles

source: Ersatzwischerblätter für Fahrzeugscheibenwischer
en: Wiper blade refills for vehicle windscreen wipers

source: Stoßdämpfer für Fahrräder
en: Shock absorbers for bicycles

source: Subsysteme für Fahrzeugsitze
en: Vehicle seat subsystems

source: Innenverkleidungen für Fahrzeuge
en: Interior panels for vehicles

source: Stahlruder für Fahrzeuge
en: Thrusters for vehicles

source: Fernalarmgeräte für Luftfahrzeuge
en: Remote alarms for air vehicles

source: Unbemannte Überwachungsfahrzeuge
en: Pilotless surveying vehicles

source: Kabinen für Drahtseilförderanlagen
en: Cars for cable transport installations

source: Anhänger [Fahrzeuge]
en: Trailers [vehicles]

source: Trittbretter [Teile von Landfahrzeugen]
en: Running boards [land vehicle parts]

source: Ferngesteuerte Landfahrzeuge
en: Remotely controlled land vehicle

source: Seitenblenden als Bauteile von Fahrzeugen
en: Side shields as structural parts of vehicles

source: Kettenumlenker für Fahrzeuge
en: Chain deflectors for vehicles

source: Kettenschutz für Fahrzeuge
en: Chainguards for vehicles

source: Bremsfallschirme für Luftfahrzeuge
en: Drag parachutes for aircraft

source: Vorderradnaben für Fahrzeuge
en: Front end hubs for vehicles

source: Nicht elektrische Anhängerkupplungen
en: Couplings (Non-electric -) for towing trailers

source: Antriebskegelräder als Teile von Landfahrzeugen
en: Crown wheels being parts of land vehicles

source: Außengepäckträger für Fahrzeuge
en: External load carriers for vehicles

source: Kippwagen
en: Tilt trucks

source: Abnehmbare Fahrzeugdächer
en: Hardtops [roofs] for vehicles

source: Gehäuse für Teile von Kraftfahrzeugen [ausgenommen für Motoren]
en: Crankcases for components for motor cars (other than for engines)

source: Angepasste Rollos für Fahrzeuge
en: Blinds adapted for vehicles

source: Ventilatormotoren für Landfahrzeuge
en: Fan motors for land vehicles

source: Rahmen zum Stützen eines Kindes in einem Fahrzeug
en: Frames for supporting a child in a vehicle

source: Felgen für Fahrzeugräder
en: Rims for vehicle wheels

source: Angepasste Behälter für Fahrzeuginnenräume
en: Containers adapted for use in vehicle interiors

source: Klappverdecke als Teile von Autos
en: Convertible roofs being parts of cars

source: Oberirdische Drahtseilförderanlage für die Personenbeförderung
en: Conveying installations (Aerial -) for the transportation of people

source: Getriebemotoren für Landfahrzeuge
en: Gear motors for land vehicles

source: Scheiben für Kupplungsdrucklager von Landfahrzeugen
en: Discs for clutch thrust bearings of land vehicles

source: Selbstaufblasende Flöße für Transportzwecke
en: Self-inflating rafts for transportation

source: Ladefahrzeuge mit Eigenantrieb
en: Self-propelled loading vehicles

source: Geländefahrzeuge
en: All-terrain vehicles

source: Klingeln für Motorräder
en: Bells for motorcycles

source: Federbeine, nicht aus Metall, als Fahrzeugteile
en: Struts (Non-metallic -) parts of vehicles

source: Spezielle Kindersicherheitssitze für Fahrzeuge
en: Safety seats adapted for use by children in vehicles

source: Skihalterungen für Autos
en: Ski racks for motor cars

source: Schraubenfedern für Fahrzeugaufhängungen
en: Coil springs for vehicle suspensions

source: Reifen für Busse
en: Tyres for buses

source: Speichenschutz für Fahrräder
en: Dress guards for bicycles

source: Tragflächen für Seefahrzeuge
en: Aerofoils for sea vehicles

source: Tragflächen für Wasserfahrzeuge
en: Aerofoils for water vehicles

source: Instrumententafeln [Motorradteile]
en: Front dash panels [parts of motorcycles]

source: Gabelstapler und Bauteile dafür
en: Forklifts, and structural parts therefor

source: Bremsen [Fahrradteile]
en: Brakes [bicycle parts]

source: Bremsbeläge für Landfahrzeuge
en: Brake linings for land vehicles

source: Alarmanlagen für Kraftfahrzeuge
en: Alarm systems for motor vehicles

source: Geländegängige Gabelstapler mit Teleskopausleger
en: All-terrain fork-lift trucks having a telescopic arm

source: Federbeine für Fahrzeuge
en: Suspension struts for vehicles

source: Metallklingeln für Fahrräder
en: Metal bells for bicycles

source: Anlasserritzel für Landfahrzeuge
en: Starter pinions for land vehicles

source: Keilwellen [verschiebbar] als Teile von Landfahrzeuggetrieben
en: Splines (sliding -) [parts of land vehicle gearing]

source: Gummiflicken zur Reparatur von Fahrzeugreifen
en: Rubber patches for repairing vehicle tyres

source: Vorrichtungen zur Kraftübertragung für Landfahrzeuge
en: Power transmission mechanisms for land vehicles

source: Sicherheitsalarmanlagen für Fahrzeuge
en: Security alarm systems for vehicles

source: Pumpen zum Aufpumpen von Fahrzeugreifen
en: Pumps for inflating vehicle tyres

source: Hydraulische Servoventile als Teile von Fahrzeugbremsanlagen
en: Hydraulic servo valves being parts of vehicle braking systems

source: Schiebedächer für Wasserfahrzeuge
en: Sliding roofs for water vehicles

source: Puffer für Schienenfahrzeuge
en: Buffers for railway rolling stock

source: Betten und Liegen für Fahrzeuge
en: Sleeping berths for vehicles

source: Räder für Motorräder
en: Wheels for motorcycles

source: Babysicherheitssitze für Fahrzeuge
en: Safety seats for babies for use in vehicles

source: Kupplungszylinder für Landfahrzeuge
en: Clutch cylinders for land vehicles

source: Wasserfahrzeuge
en: Water vehicles

source: Luftpumpen [Fahrzeugzubehör]
en: Air pumps [vehicle accessories]

source: Elektromotoren für Landfahrzeuge
en: Motors, electric, for land vehicles

source: Kinderwagen mit herausnehmbaren Kinderstützen
en: Infants' carriages with removable infant supports

source: Fahrzeugsitze für Wasserfahrzeuge
en: Seat cushions for the seats of vehicles

source: Übersetzungsgetriebe für Landfahrzeuge
en: Transmissions for land vehicles

source: Textile Gleitschutzüberzüge für Reifen
en: Anti-skid textile covers for tires

source: Stoßfänger als Teile der Fahrzeugaufhängung
en: Shock absorbers being parts of vehicle suspension

source: Federbeine [Fahrzeugteile]
en: Suspension struts [vehicle parts]

source: Druckluftturbinen für Landfahrzeuge
en: Air turbines for land vehicles

source: Stützräder für Fahrzeuge
en: Jockey wheels for vehicles

source: Fahrradreifen
en: Bicycle tyres

source: Behälter für das Halten des Flüssigkeitsstands in Fahrzeugbremssystemen
en: Reservoirs for maintaining the level of fluids in vehicle braking systems

source: Spiegel für Fahrzeuge
en: Mirrors for vehicles

source: Schalthebel [Motorradteile]
en: Shift levers [parts of motorcycles]

source: Haken [Anhängerkupplungen] für Fahrzeuge
en: Hooks [tow hitches] for vehicles

source: Schutzbezüge für Fahrzeugsitze [eingeformt]
en: Protective covers for vehicle seats [shaped]

source: Drahtseilfördergeräte und -anlagen
en: Cable transport apparatus and installations

source: Bremsanlagen für Fahrzeuge und deren Teile
en: Braking systems for vehicles and parts thereof

source: Elektrofahrzeuge mit Eigenantrieb
en: Self-propelled electric vehicle

source: Gleitschutzvorrichtungen für Fahrzeugreifen
en: Non-skid devices for vehicle tires [tyres]

source: Torsionswellen für Fahrzeuge
en: Torsion bars for vehicles

source: Skilifte
en: Ski lifts

source: Automatikgetriebe für Kraftfahrzeuge
en: Automatic gearboxes for motor cars

source: Kunststoffplanken für Flugzeuge
en: Plastic strakes for use on aircraft

source: Pritschenwagen
en: Platform trucks

source: Gepäckwagen mit Motorantrieb
en: Motorized luggage carts

source: Getriebe für Landkraftfahrzeuge
en: Gear assemblies for land vehicles

source: Nicht elektrische Kupplungsmuffen [Motoren- und Landfahrzeugteile]
en: Coupling sleeves (non-electric -) [parts of engines for land vehicles]

source: Kurbeln [Teile von Landfahrzeugen]
en: Cranks [parts of land vehicles]

source: Landfahrzeuge mit Dieselturbinenmotoren
en: Diesel turbine engines land vehicles

source: Elektrisch betriebene Roller
en: Electrically operated scooters

source: Transportwagen mit Elektroantrieb
en: Electrically powered trolleys

source: Radabdeckungen für Fahrzeuge
en: Wheel covers [for vehicles]

source: Räder
en: Wheels

source: Eingelassene Heckrotoren für Hubschrauber
en: Shrouded tail rotors for helicopters

source: Zigarrenanzünder für Automobile
en: Cigar lighters for automobiles

source: Reifen für Rollstühle
en: Tyres for wheelchairs

source: Gepanzerte Fahrzeuge
en: Armoured vehicles

source: Kompressoren zur Aufladung von Verbrennungsmotoren von Landfahrzeugen
en: Compressors for supercharging internal combustion engines of land vehicles

source: Klappsitze für Fahrzeuge
en: Convertible car seats

source: Getriebezug für Landfahrzeuge
en: Gear train parts for land vehicles

source: Lenkerarmaturen für Mopeds
en: Handlebar controls for mopeds

source: Sportwagen
en: Sports cars

source: Luftdruckpumpen als Fahrzeugzubehör
en: Air pressure pumps [vehicle accessories]

source: Bremsensets für Fahrzeuge
en: Brake sets for vehicles

source: Angepasste Stauraumbehältnisse für Fahrzeuge
en: Storage containers adapted for use in vehicles

source: Kanus
en: Canoes

source: Bullaugen
en: Portholes

source: Stoßstangen aus Metall für Fahrzeuge
en: Bumper guards of metal for vehicles

source: Japanische flachbodige Ruderboote [Tenmasen]
en: Japanese flat-bottomed rowboats [tenmasen]

source: Elektrische Rückfahrwarngeräte für Fahrzeuge
en: Electric reversing alarms for vehicles

source: Elektroautos
en: Electric cars

source: Lenkstangen [Fahrradteile]
en: Handlebars [bicycle parts]

source: Alarmanlagen für Wasserfahrzeuge
en: Alarm systems for watercraft

source: Metallspikes für Fahrzeugreifen
en: Metal studs for vehicle tyres

source: Stapelmaschinen [Gabelstabler]
en: Stacking machines [fork-lift trucks]

source: Lenksäulen für Fahrzeuge
en: Steering columns for vehicles

source: Fußriemen für Fahrräder
en: Toe straps for use on bicycles

source: Torsionsdämpfer für Fahrzeuge
en: Torsion dampers for vehicles

source: Laufflächen aus Gummi zur Verwendung bei der Runderneuerung von Reifen
en: Rubber tread patterns for use in retreading recycled tyres

source: Gehäusedeckel für Landfahrzeugmotoren
en: Housing covers for land vehicle engines

source: Kippkarren
en: Tilting-carts

source: Schiebedächer für Kraftfahrzeuge
en: Sliding roofs for motor vehicles

source: Stützräder für Anhängerkupplungen von Landfahrzeugen
en: Hitch stabilisers for use with motor land vehicles

source: Propeller für Flugzeuge
en: Airplane propellers

source: Fahrzeuge mit Übernachtungsmöglichkeit
en: Vehicles fitted with living accommodation

source: Autositze
en: Car seats

source: Wohnwagen
en: Caravans

source: Sitze für Wasserfahrzeuge
en: Seating for water vehicles

source: Kopfstützen für Autositze
en: Head-rests for car seats

source: Motorisierte Fahrräder
en: Motorised bicycles

source: Antriebswellen für Landfahrzeuge
en: Transmission shafts for land vehicles

source: Spoiler für Wasserfahrzeuge
en: Spoilers for water vehicles

source: Luftabweiser für Fahrzeuge
en: Air deflectors for vehicles

source: Fahrzeugsitzbezüge [angepasst]
en: Vehicle seat covers [fitted]

source: Benzintankdeckel für Kraftfahrzeuge
en: Petrol tank caps for motor cars

source: Spoiler für Landfahrzeuge
en: Spoilers for land vehicles

source: Fahrzeuge für Körperbehinderte
en: Vehicles adapted for the disabled

source: Einzelne Bezüge für Fahrzeugsitze [angepasst]
en: Loose seat covers [shaped] for vehicle seats

source: Schonbezüge für Fahrzeugsitze
en: Seat covers for vehicles

source: Airbags für Fahrzeuge
en: Airbags for vehicles

source: Hydraulikkupplungen für Landfahrzeuge
en: Hydraulic couplings for land vehicles

source: Rädergetriebe für Landfahrzeuge
en: Gearing for land vehicles

source: Kindertragesitze für Fahrzeuge
en: Child carrying seats for use in vehicles

source: Hydraulische Kupplungen für Fahrzeuge
en: Hydraulic connectors for vehicles

source: Autositze für Kinder
en: Children's car seats

source: Ritzel für Landfahrzeuge
en: Pinions for land vehicles

source: Gepäcknetze für Fahrzeuge
en: Luggage nets for vehicles

source: Fahrradträger für Fahrzeuge
en: Bicycle racks for vehicles

source: Fahrzeuge mit Kippvorrichtungen
en: Vehicles for the tipping loads

source: Kindersicherheitssitze für Autos
en: Car safety seats for children

source: Sicherheitskindersitze für Fahrzeuge
en: Safety seats for children, for vehicles

source: Bremsen für Landfahrzeuge
en: Brakes for land vehicles

source: Untergestelle für Fahrzeuge
en: Undercarts for vehicles

source: Raupenketten für Fahrzeuge
en: Treads for vehicles [tractor type]

source: Stoßdämpferfedern für Fahrzeuge
en: Shock absorbing springs for vehicles

source: Stoßdämpfer für Kraftfahrzeuge
en: Shock absorbers for automobiles

source: Stoßdämpfer für Fahrzeuge
en: Vehicle shock absorbers

source: Räder, Reifen und Gleisketten
en: Wheels, tyres and continuous tracks

source: Teile und Zubehör für Landfahrzeuge
en: Parts and fittings for land vehicles

source: Teile und Zubehör für Wasserfahrzeuge
en: Parts and fittings for water vehicles

source: Diebstahlschutz-, Sicherungs- und Sicherheitsgeräte und - anlagen für Fahrzeuge
en: Anti-theft, security and safety devices and equipment for vehicles

source: Teile und Zubehör für Luft- und Raumfahrzeuge
en: Parts and fittings for air and space vehicles

source: Antriebe, einschließlich Motoren und Triebwerke, für Landfahrzeuge
en: Powertrains, including engines and motors, for land vehicles

source: Teile und Zubehör für Fahrzeuge
en: Parts and fittings for vehicles

source: Luft- und Raumfahrzeuge
en: Air and space vehicles

source: Maschinerie zur Fortbewegung an Land
en: Apparatus for locomotion by land

source: Nivelliergeräte für Wohnwagen
en: Levelling apparatus for caravans

source: Drohne
en: Drone

source: Flugzeugsitze
en: Airplane seats

source: Selbstfahrende Transportfahrzeuge
en: Self-driving transport vehicles

source: Kettenschutz für zweirädrige Motorfahrzeuge
en: Drive-chain guards for two-wheeled motor vehicles

source: Rahmen für zweirädrige Motorfahrzeuge
en: Frames for two-wheeled motor vehicles

source: Ausleger für Wasserfahrzeuge
en: Outriggers for watercraft

source: Ferngesteuerte Fahrzeuge für Unterwasseruntersuchungen
en: Remotely operated vehicles for underwater inspections

source: Autonome Unterwasserfahrzeuge für Untersuchungen des Meeresbodens
en: Autonomous underwater vehicles for seabed inspections

source: Faltbälge für Gelenkbusse
en: Bellows for articulated buses

source: Schleppfahrzeuge für Flugzeuge
en: Aeroplanes towing vehicles

source: Luftpumpen für Automobile
en: Air pumps for automobiles

source: Luftpumpen für motorisierte Zweiräder oder Fahrräder
en: Air pumps for two-wheeled motor vehicles or bicycles

source: Gleitschutzstifte für Fahrzeugreifen
en: Anti-skid studs for vehicle tires

source: Riemenscheiben für Landfahrzeuge
en: Belt pulleys for land vehicles

source: Kegelbremsen für Landfahrzeuge
en: Cone brakes for land vehicles

source: Fahrtrichtungsanzeiger für Kraftfahrzeuge
en: Direction signals for automobiles

source: Scheibenbremsen für Landfahrzeuge
en: Disc brakes for land vehicles

source: Türen für Eisenbahnwagen
en: Doors for railway cars

source: Elektrisch betriebene Omnibusse
en: Electrically powered buses

source: Gasturbinen für Landfahrzeuge
en: Gas turbines for land vehicles

source: Leerlaufscheiben für Landfahrzeuge
en: Idling pulleys for land vehicles

source: Schutzbleche für motorisierte Zweiräder oder Fahrräder
en: Mudguards for two-wheeled motor vehicles or bicycles

source: Rollenketten für Landfahrzeuge
en: Roller chains for land vehicles

source: Rotorblätter für Hubschrauber
en: Rotor blades for helicopters

source: Sitze für Eisenbahnwagen
en: Seats for railway cars

source: Spindeln für Landfahrzeuge
en: Spindles for land vehicles

source: Spindeln von Fahrrädern
en: Spindles of bicycles

source: Dampfsteuergeräte für Wasserfahrzeuge
en: Steam steering gears for vessels [for vessels]

source: Dampfturbinen für Landfahrzeuge
en: Steam turbines for land vehicles

source: Reifen für Fahrwerksräder von Luftfahrzeugen
en: Tires for aircraft landing gear wheels

source: Fernbetätigte Unterwasserfahrzeuge für den Transport [ROV]
en: Underwater remotely operated vehicles (ROVs) for transport

source: Reifen [Pneus]
en: Pneumatic tyres

source: Schlitten [Fahrzeuge]
en: Sleighs [vehicles]

source: Treibketten für Landfahrzeuge
en: Driving chains for land vehicles

source: Antriebsketten für Landfahrzeuge
en: Transmission chains for land vehicles

source: Skiträger für Fahrzeuge
en: Ski carriers for vehicles

source: Reifen für Fahrzeugräder
en: Tyres for vehicle wheels

source: Gepäckträger für Fahrzeuge
en: Luggage carriers for vehicles

source: Gepäckgestelle für Fahrzeuge
en: Cargo carriers for vehicles

source: Schaluppen
en: Launches

source: Aufblasbare Boote
en: Inflatable boats

source: Sicherheitsgurte für Fahrzeugsitze
en: Safety belts for vehicle seats

source: Sicherheits-Kombigurte für Fahrzeugsitze
en: Security harness for vehicle seats

source: Abdeckhauben für Fahrzeuge
en: Vehicle covers [shaped]

source: Motoren für Landfahrzeuge
en: Engines for land vehicles

source: Antriebsmaschinen für Landfahrzeuge
en: Driving motors for land vehicles

source: Dachgepäckträger für Autos
en: Car-top luggage carriers

source: Dachträger für Fahrzeuge
en: Automobile roof racks

source: Eisenbahnwagen
en: Railway carriages

source: Anhängerkupplungen für Fahrzeuge
en: Trailer hitches for vehicles

source: Autobusse
en: Motor buses

source: Omnibusse
en: Omnibuses

source: Bremsbacken für Fahrzeuge
en: Brake segments for vehicles

source: Bremsschuhe für Fahrzeuge
en: Brake shoes for vehicles

source: Buffetwagen, Imbisswagen
en: Dining cars [carriages]

source: Motorlager für Landfahrzeuge
en: Engine mounts for land vehicles

source: Buggys für Haustiere
en: Pushchairs for pets

source: Schalthebelsäcke für Kraftfahrzeuge
en: Shift boots for motor vehicles

source: Schiffsballasttanks [strukturelle Bestandteile von Schiffen]
en: Ship ballast tanks [structural components of vessels]

source: Speichen für zweirädrige Motorfahrzeuge
en: Spokes for two-wheeled motor vehicles

source: Achslager für Landfahrzeuge
en: Axle bearings for land vehicles

source: Bremsgriffe für Fahrräder
en: Bicycle brake lever grips

source: Elektrische Zigarettenanzünder für Landfahrzeuge
en: Electric cigarette lighters for land vehicles

source: Radfelgen für Motorräder
en: Wheel rims for motorcycles

source: Kinderfahrräder
en: Children's bicycles

source: Steuereinheiten für Landfahrzeuge
en: Steering units for land vehicles

source: Wägelchen zum Transport von Kindern
en: Small wagons for transporting children

source: Strukturteile für Züge
en: Structural parts for trains

source: Propellerblattschutzvorrichtungen für Boote
en: Propeller blade protectors for boats

source: Bremsscheiben für Motorräder
en: Brake discs for motorcycles

source: Bremspedale für Fahrzeuge
en: Brake pedals for vehicles

source: Bremskabel für Fahrräder
en: Brake cables for bicycles

source: Motorisierte Imbisswagen
en: Motorized food carts

source: Kotflügel für Lastwagen
en: Mudguards for trucks

source: Schutzbleche für Motorräder
en: Mudguards for motorcycles

source: Gepäckträger zum Anbringen auf Fahrzeughauben
en: Luggage racks for attachment to vehicle hoods

source: Flachbodige Ruderboote
en: Flat-bottomed rowboats

source: Tragflügel für Boote
en: Hydrofoils for boats

source: Hydraulische Felgenbremsen
en: Hydraulic rim brakes for bicycles

source: Hydraulische Scheibenbremsen für Fahrräder
en: Hydraulic disc brakes for bicycles

source: Gepäckträger für Motorräder
en: Luggage carriers for motorcycles

source: Scheibenbremsenbeläge für Landfahrzeuge
en: Disc brake pads for land vehicles

source: Bremssysteme für Landfahrzeuge
en: Brake systems for land vehicles

source: Bremszylinder für Landfahrzeuge
en: Brake cylinders for land vehicles

source: Anhänger zum Transport von Fahrrädern
en: Trailers for transporting bicycles

source: Antriebsstränge für Fahrräder
en: Drivetrains for bicycles

source: Kardanwellen für Fahrzeuge
en: Cardan shafts for vehicles

source: Flugzeugsitze mit Massagefunktion
en: Airline seats with a massage function

source: Radaufhängungssysteme für Automobile
en: Suspension systems for automobiles

source: Radaufhängungssysteme für Fahrräder
en: Suspension systems for bicycles

source: Räder für Eisenbahnwagen
en: Wheels for railway cars

source: Sicherheitsgurte für den Autorennsport
en: Safety harnesses for auto racing

source: Masten für Segelboote
en: Sailing boat masts

source: Radlager für Landfahrzeuge
en: Wheel bearings for land vehicles

source: Kardangelenke für Landfahrzeuge
en: Universal joints for land vehicles

source: Oberdeckel für Getriebe von Landfahrzeugen
en: Transmission top covers for land vehicles

source: Radaufhängungssysteme für Landfahrzeuge
en: Suspension systems for land vehicles

source: Strukturteile für Rettungswagen
en: Structural parts for ambulances

source: Strukturteile für Lieferwagen
en: Structural parts for vans

source: Strukturteile für Lastwagen
en: Structural parts for trucks

source: Strukturteile für Motorräder
en: Structural parts for motorcycles

source: Propellerwellen für Boote
en: Propeller shafts for boats

source: Stoßdämpferfedern für Automobile
en: Shock absorbing springs for automobiles

source: Hydraulische Drehmomentwandler für Landfahrzeuge
en: Hydraulic torque converters for land vehicles

source: Benzinmotoren für Landfahrzeuge
en: Gasoline engines for land vehicles

source: Schläuche für Motorradreifen
en: Inner tubes for motorcycle tires

source: Luftpumpen für Motorräder
en: Air pumps for motorcycles

source: Signalhupen für Motorräder
en: Warning horns for motorcycles

source: Zivile Drohnen
en: Civilian drones

source: Seitenspiegel für Fahrzeuge
en: Side view mirrors for vehicles

source: Führerlose Fahrzeuge [autonome Fahrzeuge]
en: Driverless cars [autonomous cars]

source: Gepäcktaschen für Motorräder
en: Panniers adapted for motorcycles

source: Speichen für Automobile
en: Spokes for automobiles

source: Speichen für Motorräder
en: Spokes for motorcycles

source: Freilaufräder für Motorräder
en: Freewheels for motorcycles

source: Freilaufräder für Fahrräder
en: Freewheels for bicycles

source: Vorderradgabeln für Motorräder
en: Front forks for motorcycles

source: Tretroller [Fahrzeuge]
en: Push scooters [vehicles]

source: Einräder
en: Unicycles

source: Selbstbalancierende Einräder
en: Self balancing unicycles

source: Selbstbalancierende Elektroroller
en: Self balancing electric scooters
